public/index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Noah Marti</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="https://cdn.simplecss.org/simple.min.css" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Noah Marti</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org69ad551">Projects</a>
<ul>
<li><a href="#org308f446">Asdf</a></li>
</ul>
</li>
<li><a href="#org5937088">Publications</a>
<ul>
<li><a href="#org31d71de">Temporal horizons in forecasting: a performance-learnability trade-off</a></li>
</ul>
</li>
<li><a href="#orgf25c26e">Overview</a></li>
</ul>
</div>
</div>
<div id="outline-container-org69ad551" class="outline-2">
<h2 id="org69ad551">Projects</h2>
<div class="outline-text-2" id="text-org69ad551">
</div>
<div id="outline-container-org308f446" class="outline-3">
<h3 id="org308f446">Asdf</h3>
<div class="outline-text-3" id="text-org308f446">
<p>
asdf
</p>
</div>
</div>
</div>
<div id="outline-container-org5937088" class="outline-2">
<h2 id="org5937088">Publications</h2>
<div class="outline-text-2" id="text-org5937088">
</div>
<div id="outline-container-org31d71de" class="outline-3">
<h3 id="org31d71de">Temporal horizons in forecasting: a performance-learnability trade-off</h3>
<div class="outline-text-3" id="text-org31d71de">
<p>
When training autoregressive models to forecast dynamical systems, a critical question arises: how far into the
future should the model be trained to predict? Too short a horizon may miss long-term trends, while too long a
horizon can impede convergence due to accumulating prediction errors. In this work, we formalize this trade-off
by analyzing how the geometry of the loss landscape depends on the training horizon. We prove that for chaotic
systems, the loss landscape’s roughness grows exponentially with the training horizon, while for limit cycles, it
grows linearly, making long-horizon training inherently challenging. However, we also show that models trained on
long horizons generalize well to short-term forecasts, whereas those trained on short horizons suffer exponentially
(resp. linearly) worse long-term predictions in chaotic (resp. periodic) systems. We validate our theory through
numerical experiments and discuss practical implications for selecting training horizons. Our results provide a
principled foundation for hyperparameter optimization in autoregressive forecasting models.
</p>

<p>
<a href="https://arxiv.org/pdf/2506.03889">arXiv.org</a>
</p>
</div>
</div>
</div>
<div id="outline-container-orgf25c26e" class="outline-2">
<h2 id="orgf25c26e">Overview</h2>
<div class="outline-text-2" id="text-orgf25c26e">
<p>
This is an <b>example</b> of a <span class="underline">website</span> written with <a href="https://orgmode.org">Org Mode</a>!
</p>

<p>
Here is a link to my <a href="./emacs.html">emacs configuration</a>.
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="creator"><a href="https://www.gnu.org/software/emacs/">Emacs</a> 30.1 (<a href="https://orgmode.org">Org</a> mode 9.7.11)</p>
</div>
</body>
</html>
